tutorials/incompressibleVoF/mixerVessel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    vessel
    {
        type            noSlip;
    }

    oilInlet
    {
        type            fixedValue;
        value           uniform (0 0 0.2);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    shaftRotating
    {
        type            movingWallVelocity;
        value           $internalField;
    }

    shaft
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           -50 [rpm];
        value           $internalField;
    }

    sparger
    {
        type            noSlip;
    }

    stirrer
    {
        type            movingWallVelocity;
        value           $internalField;
    }

    baffles
    {
        type            noSlip;
    }

    nonCouple
    {
        type            movingWallSlipVelocity;
        value           $internalField;
    }
}


// ************************************************************************* //
